import networkx as nx
import matplotlib.pyplot as plt

# Створення графу
metro_network = nx.Graph(name="Харківський метрополітен")

# Додавання ребер (дружба між людьми)
metro_network.add_edges_from([("Холодна гора", "Південний вокзал"), ("Південний вокзал", "Центральний ринок"), ("Центральний ринок", "Майдан конституції"),
                  ("Майдан конституції", "Проспект Гагаріна"), ("Проспект Гагаріна", "Спортивна"), ("Спортивна", "Завод Малишева"),
                  ("Завод Малишева", "Турбоатом"), ("Турбоатом", "Палац спорту"), ("Палац спорту", "Армійська"), ("Армійська", "Масельського"),
                  ("Масельського", "Тракторний завод"), ("Тракторний завод", "Індустріальна"), ("Історичний музей", "Університет"),
                  ("Університет", "Пушкінська"), ("Пушкінська", "Київська"), ("Київська", "Академіка Барабашова"),
                  ("Академіка Барабашова", "Академіка павлова"), ("Академіка павлова", "Студентська"), ("Студентська", "Героїв праці"),
                  ("Майдан конституції", "Історичний музей"), ("Метробудівників", "Захисників України"), ("Захисників України", "Архітектора Бекетова"),
                  ("Архітектора Бекетова", "Держпром"), ("Держпром", "Наукова"), ("Наукова", "Ботанічний сад"), ("Ботанічний сад", "23 серпня"),
                  ("23 серпня", "Олексіївська"), ("Олексіївська", "Перемога"), ("Спортивна", "Метробудівників"), ("Університет", "Держпром")])

pos = {"Холодна гора": (-0.8, 0.4), "Південний вокзал": (-0.7, 0.4,), "Центральний ринок": (-0.6, 0.4), "Майдан конституції": (-0.5, 0.2),
       "Проспект Гагаріна": (-0.45, 0.0), "Спортивна": (-0.3, -0.2), "Завод Малишева": (-0.2, -0.4), "Турбоатом": (-0.1, -0.6),
       "Палац спорту": (0.0, -0.8), "Армійська": (0.1, -1.0), "Масельського": (0.2, -1.2), "Тракторний завод": (0.3, -1.2), "Індустріальна": (0.4, -1.2),
       "Історичний музей": (-0.4, 0.3), "Університет": (-0.3, 0.4), "Пушкінська": (-0.2, 0.5), "Київська": (-0.15, 0.65), "Академіка Барабашова": (-0.1, 0.8),
       "Академіка павлова": (-0.05, 0.95), "Студентська": (0.0, 1.1), "Героїв праці": (0.05, 1.25), "Метробудівників": (-0.3, -0.4),
       "Захисників України": (-0.2, 0.0), "Архітектора Бекетова": (-0.2, 0.2), "Держпром": (-0.27, 0.55), "Наукова": (-0.3, 0.65),
       "Ботанічний сад": (-0.35, 0.8), "23 серпня": (-0.4, 0.95), "Олексіївська": (-0.45, 1.1), "Перемога": (-0.5, 1.25)}

# Візуалізація графу
nx.draw(metro_network, pos=pos, with_labels=True, font_weight='bold', node_color='lightblue', edge_color='gray', node_size=800, font_size=8, font_color='black')

# Додавання назви графу як заголовку
plt.title(metro_network.name)

plt.show()

# Основні характеристики графу
print("Назва графу:", metro_network.name)
print("Кількість станцій:", metro_network.number_of_nodes())
print("Кількість ліній:", metro_network.number_of_edges())

# Ступінь вершин
degrees = dict(metro_network.degree())
print("Ступінь станцій:", degrees)